src/usr/isteps/ocmbupd/odyssey-code-update-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-30 Wed 16:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Odyssey code update - Side switching FSM</title>
<meta name="author" content="zach" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Odyssey code update - Side switching FSM</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge8492e3">1. Definitions</a></li>
<li><a href="#org8771cf3">2. Code update overview</a></li>
<li><a href="#orgfe9959d">3. Error cases</a></li>
<li><a href="#org0186c51">4. Implementation details</a>
<ul>
<li><a href="#org9c2f184">4.1. State</a></li>
<li><a href="#org36a240e">4.2. FSM events</a></li>
<li><a href="#org30db44d">4.3. FSM transitions</a></li>
<li><a href="#org0ec5b01">4.4. Controlling Code Update with Attribute Overrides</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Each Odyssey has three boot SEEPROMs: one primary, one backup, and one
"golden". These each store copies of the bootloader and runtime
firmware for the SBE. These sides are used for redundancy in the face
of boot errors, and also for code updates.
</p>

<p>
The goal of the Odyssey code update (or "firmware update") process is
to write the version of the firmware that Hostboot has in its OCMBFW
PNOR partition to both the primary and backup boot SEEPROMs in a given
Odyssey chip.
</p>

<p>
The golden side is never updated. It contains a firmware version that
is known to work just enough to boot the Odyssey to a state where it
can perform a code update.
</p>

<p>
The code update process is different than that for Explorer OCMBs,
because while Explorer had primary and backup boot SEEPROMs, it
managed them transparently from Hostboot's point of view. Odyssey
exposes the primary and backup SEEPROMs to Hostboot, and Hostboot has
to manage the update process.
</p>

<div id="outline-container-orge8492e3" class="outline-2">
<h2 id="orge8492e3"><span class="section-number-2">1.</span> Definitions</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>A <b>boot side</b> on an Odyssey chip refers to one of the boot SEEPROMs,
either side 0, side 1, or golden, which contains a complete and
independent copy of the Odyssey bootloader and runtime firmware.</li>
<li>The <b>active</b> side is the side (side 0, side 1, or golden) that is
currently being used to boot.</li>
<li>The <b>alternate</b> side is the side that is not currently being used to
boot. This term usually only applies if side 0 or side 1 is the
active side.</li>
<li><b>Primary</b> and <b>backup</b> are alternate terms for boot sides 0 and 1,
respectively.</li>
<li><b>Inband</b> or <b>OMI</b> or <b>fast</b> code update happens when we can boot the
Odyssey up far enough to communicate with it over the memory
controller (i.e. when we make it to update_omi_firmware). This is
much faster than I2C updates, and we want to do this whenever we
can.</li>
<li><b>Out-of-band</b> or <b>OOB</b> or <b>I2C</b> or <b>slow</b> code update happens when
the Odyssey firmware boots up enough for Hostboot to communicate
with the Odyssey via I2C and invoke chipops on it, but not enough to
send traffic to it via the memory controller. I2C updates are very
slow, but less of the firmware needs to be functional for this
update method to succeed. When booting from the golden side, this is
the only update method available to us.</li>
</ul>
</div>
</div>

<div id="outline-container-org8771cf3" class="outline-2">
<h2 id="org8771cf3"><span class="section-number-2">2.</span> Code update overview</h2>
<div class="outline-text-2" id="text-2">
<p>
The overall good-path process for a single OCMB chip goes like this
(assuming the code on the Odyssey is out of date):
</p>

<ol class="org-ol">
<li>The Odyssey is booted up from its side 0 boot SEEPROM, and passes
ocmb_check_for_ready (istep 11.4). Hostboot determines whether the
version of code running on side 0 is up to date or not.</li>
<li>Memory is initialized in istep 12, and in istep 12.12
(update_omi_firmware), we update the boot code on side 1.</li>
<li>We switch sides (taking effect next boot), and perform a reconfig
loop.</li>
<li>When Hostboot reaches Istep 11.4 again, it boots the Odyssey from
side 1. The code now looks "up to date" from Hostboot's perspective
because the currently-active side was updated on the previous boot
by step 2.</li>
<li>Memory is initialized, and the IPL reaches host_ipl_complete (istep
16).</li>
<li>Hostboot calls a chipop on the Odyssey that will overwrite the
contents of the alternate side with that of the active side. In
effect this updates side 0. (We always call this chipop at this
istep, but it won't do anything if side 0 already matches side 1.)</li>
<li>We then continue to boot to runtime.</li>
</ol>

<p>
Note that on every full re-IPL, each Odyssey starts from
side 0. Errors may cause Hostboot to switch to side 1 to boot, but
this state isn't remembered on subsequent full IPLs (it is remembered
for reconfig loops though).
</p>
</div>
</div>

<div id="outline-container-orgfe9959d" class="outline-2">
<h2 id="orgfe9959d"><span class="section-number-2">3.</span> Error cases</h2>
<div class="outline-text-2" id="text-3">
<p>
Hostboot handles errors that occur between ocmb_check_for_ready and
update_omi_firmware by taking several actions:
</p>

<ul class="org-ul">
<li>If we haven't tried booting from side 1, Hostboot will restart the
memory boot process on that side (either by a reconfig loop or by
restarting ocmb_check_for_ready's HWPs if we're still in that
istep).</li>
<li>If we can't make it to update_omi_firmware to do a fast inband
update (due to any error), Hostboot will perform a slower I2C update
instead.</li>
<li>If the firmware is out of date and we cannot boot the Odyssey up far
enough on any of the three sides to update the firmware, the OCMB is
deconfigured (i.e. we will never boot with a functional but
out-of-date Odyssey).</li>
</ul>
</div>
</div>

<div id="outline-container-org0186c51" class="outline-2">
<h2 id="org0186c51"><span class="section-number-2">4.</span> Implementation details</h2>
<div class="outline-text-2" id="text-4">
<p>
The Odyssey code update process is controlled by the Odyssey Code
Update Finite State Machine (FSM), implemented in ody_upd_fsm.C.
</p>
</div>

<div id="outline-container-org9c2f184" class="outline-3">
<h3 id="org9c2f184"><span class="section-number-3">4.1.</span> State</h3>
<div class="outline-text-3" id="text-4-1">
<p>
There are four state variables for the FSM to track. These variables
are set to their "init" values on a BMC firmware update; when an OCMB
part is removed or added (or deconfigured); and at host_ipl_complete
(on ALL OCMBs, present or not).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Values</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Location</th>
<th scope="col" class="org-left">Duration</th>
<th scope="col" class="org-right">Init</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Code update performed?</td>
<td class="org-left">Yes, no</td>
<td class="org-left">Has an OMI or I2C code update been performed this boot attempt?</td>
<td class="org-left">ATTR_OCMB_CODE_UPDATED</td>
<td class="org-left">non-volatile</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Golden boot performed?</td>
<td class="org-left">Yes, no</td>
<td class="org-left">Has the OCMB been booted from the golden side this boot attempt?</td>
<td class="org-left">ATTR_OCMB_GOLDEN_BOOT_ATTEMPTED</td>
<td class="org-left">non-volatile</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Side?</td>
<td class="org-left">0, 1, Golden</td>
<td class="org-left">What side is the OCMB currently set to boot from?</td>
<td class="org-left">ATTR_OCMB_BOOT_SIDE</td>
<td class="org-left">non-volatile</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Fw current?</td>
<td class="org-left">Yes, no, unknown</td>
<td class="org-left">Is the firmware level flashed on the device up to date with the version Hostboot has in PNOR?</td>
<td class="org-left">ATTR_OCMB_FW_STATE</td>
<td class="org-left">volatile</td>
<td class="org-right">"UNKNOWN"</td>
</tr>
</tbody>
</table>
</div>
</div>
