src/usr/isteps/ocmbupd/odyssey-code-update-notes.org
** FSM events

When these events occur, the FSM is invoked to handle them and take
action if necessary.

- Boot to check_for_ready (i.e. we can tell what code version the sbe
  is running)
- Unrecoverable boot error (ody_sppe_check_for_ready fails, any error
  except RC_POZ_SPPE_NOT_READY_ERR with async FFDC)
- Recoverable boot error (ody_sppe_check_for_ready fails with
  RC_POZ_SPPE_NOT_READY_ERR and async FFDC is present)
- OCMB HWP fail, hash fail encountered
- Other OCMB HWP fail encountered
- HWP fail encountered on some non-OCMB target
- Attribute incompatibility detected
- Code update failure
- Image sync failure or measurement registers mismatch
- Boot to update_omi_firmware
- IPL completed (host_ipl_complete)

** FSM transitions

This table is a *template* for transitions that could happen in
response to each event. The table in ody_upd_fsm.C is essentially just
a collection of "instantiations" of this table for each possible event
type.

 | Code update performed? | Golden boot performed? | Active side | Fw current? | Transition     | Description                                                                                               |
 |------------------------+------------------------+-------------+-------------+----------------+-----------------------------------------------------------------------------------------------------------|
 | No                     | No                     |           0 | no          |                | Normal IPL, first try                                                                                     |
 | No                     | No                     |           1 | no          |                | Side 0 failed IPL, trying side 1                                                                          |
 | No                     | Yes                    |           0 | no          | (Can't happen) | (Can't boot side 0 or 1 after golden without updating code)                                               |
 | No                     | Yes                    |           1 | no          | (Can't happen) | (Can't boot side 0 or 1 after golden without updating code)                                               |
 | Yes                    | No                     |           0 | no          |                | Side 1 performed a code update (because side 0 failed), and code update didn't do anything                |
 | Yes                    | No                     |           1 | no          |                | Normal code update flow, side 0 performed a code update, and code update didn't do anything               |
 | Yes                    | Yes                    |           0 | no          |                | Golden side updated code, and code update didn't do anything                                              |
 | Yes                    | Yes                    |           1 | no          |                | Golden side updated code, booting from side 0 failed, and golden code update didn't do anything to side 1 |
 | No                     | No                     |      Golden | no          |                | Failures happened on both side 0 and 1 and never got to try a code update, trying golden now              |
 | No                     | Yes                    |      Golden | no          | (Can't happen) | (Can't do a golden boot twice)                                                                            |
 | Yes                    | No                     |      Golden | no          |                | Failures happened on both side 0 and 1 but we did try to update code before, trying golden now            |
 | Yes                    | Yes                    |      Golden | no          | (Can't happen) | (Can't do a golden boot twice)                                                                            |
 |------------------------+------------------------+-------------+-------------+----------------+-----------------------------------------------------------------------------------------------------------|
 | No                     | No                     |           0 | yes         |                | Normal IPL, first try                                                                                     |
 | No                     | No                     |           1 | yes         |                | Side 0 failed IPL, trying side 1                                                                          |
 | No                     | Yes                    |           0 | yes         | (Can't happen) | (Can't boot side 0 or 1 after golden without updating code)                                               |
 | No                     | Yes                    |           1 | yes         | (Can't happen) | (Can't boot side 0 or 1 after golden without updating code)                                               |
 | Yes                    | No                     |           0 | yes         |                | Side 1 performed a code update (because side 0 failed), trying side 0 now                                 |
 | Yes                    | No                     |           1 | yes         |                | Normal code update flow, side 0 performed a code update, trying side 1 now                                |
 | Yes                    | Yes                    |           0 | yes         |                | Golden side updated code, trying to boot from side 0 now                                                  |
 | Yes                    | Yes                    |           1 | yes         |                | Golden side updated code, booting from side 0 failed, trying side 1                                       |
 | No                     | No                     |      Golden | yes         | (Can't happen) | (Golden side fw is never considered current)                                                              |
 | No                     | Yes                    |      Golden | yes         | (Can't happen) | (Can't do a golden boot twice)                                                                            |
 | Yes                    | No                     |      Golden | yes         | (Can't happen) | (Golden side fw is never considered current)                                                              |
 | Yes                    | Yes                    |      Golden | yes         | (Can't happen) | (Can't do a golden boot twice)                                                                            |

