src/usr/isteps/ocmbupd/odyssey-code-update-notes.html

<div id="outline-container-org36a240e" class="outline-3">
<h3 id="org36a240e"><span class="section-number-3">4.2.</span> FSM events</h3>
<div class="outline-text-3" id="text-4-2">
<p>
When these events occur, the FSM is invoked to handle them and take
action if necessary.
</p>

<ul class="org-ul">
<li>Boot to check_for_ready (i.e. we can tell what code version the sbe
is running)</li>
<li>Unrecoverable boot error (ody_sppe_check_for_ready fails, any error
except RC_POZ_SPPE_NOT_READY_ERR with async FFDC)</li>
<li>Recoverable boot error (ody_sppe_check_for_ready fails with
RC_POZ_SPPE_NOT_READY_ERR and async FFDC is present)</li>
<li>OCMB HWP fail, hash fail encountered</li>
<li>Other OCMB HWP fail encountered</li>
<li>HWP fail encountered on some non-OCMB target</li>
<li>Attribute incompatibility detected</li>
<li>Code update failure</li>
<li>Image sync failure or measurement registers mismatch</li>
<li>Boot to update_omi_firmware</li>
<li>IPL completed (host_ipl_complete)</li>
</ul>
</div>
</div>

<div id="outline-container-org30db44d" class="outline-3">
<h3 id="org30db44d"><span class="section-number-3">4.3.</span> FSM transitions</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This table is a <b>template</b> for transitions that could happen in
response to each event. The table in ody_upd_fsm.C is essentially just
a collection of "instantiations" of this table for each possible event
type.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Code update performed?</th>
<th scope="col" class="org-left">Golden boot performed?</th>
<th scope="col" class="org-right">Active side</th>
<th scope="col" class="org-left">Fw current?</th>
<th scope="col" class="org-left">Transition</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">No</td>
<td class="org-left">No</td>
<td class="org-right">0</td>
<td class="org-left">no</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Normal IPL, first try</td>
</tr>

<tr>
<td class="org-left">No</td>
<td class="org-left">No</td>
<td class="org-right">1</td>
<td class="org-left">no</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Side 0 failed IPL, trying side 1</td>
</tr>

<tr>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-right">0</td>
<td class="org-left">no</td>
<td class="org-left">(Can't happen)</td>
<td class="org-left">(Can't boot side 0 or 1 after golden without updating code)</td>
</tr>

<tr>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-right">1</td>
<td class="org-left">no</td>
<td class="org-left">(Can't happen)</td>
<td class="org-left">(Can't boot side 0 or 1 after golden without updating code)</td>
</tr>

<tr>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-right">0</td>
<td class="org-left">no</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Side 1 performed a code update (because side 0 failed), and code update didn't do anything</td>
</tr>

<tr>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-right">1</td>
<td class="org-left">no</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Normal code update flow, side 0 performed a code update, and code update didn't do anything</td>
</tr>

<tr>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-right">0</td>
<td class="org-left">no</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Golden side updated code, and code update didn't do anything</td>
</tr>

<tr>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-right">1</td>
<td class="org-left">no</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Golden side updated code, booting from side 0 failed, and golden code update didn't do anything to side 1</td>
</tr>

<tr>
<td class="org-left">No</td>
<td class="org-left">No</td>
<td class="org-right">Golden</td>
<td class="org-left">no</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Failures happened on both side 0 and 1 and never got to try a code update, trying golden now</td>
</tr>

<tr>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-right">Golden</td>
<td class="org-left">no</td>
<td class="org-left">(Can't happen)</td>
<td class="org-left">(Can't do a golden boot twice)</td>
</tr>

<tr>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-right">Golden</td>
<td class="org-left">no</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Failures happened on both side 0 and 1 but we did try to update code before, trying golden now</td>
</tr>

<tr>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-right">Golden</td>
<td class="org-left">no</td>
<td class="org-left">(Can't happen)</td>
<td class="org-left">(Can't do a golden boot twice)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">No</td>
<td class="org-left">No</td>
<td class="org-right">0</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Normal IPL, first try</td>
</tr>

<tr>
<td class="org-left">No</td>
<td class="org-left">No</td>
<td class="org-right">1</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Side 0 failed IPL, trying side 1</td>
</tr>

<tr>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-right">0</td>
<td class="org-left">yes</td>
<td class="org-left">(Can't happen)</td>
<td class="org-left">(Can't boot side 0 or 1 after golden without updating code)</td>
</tr>

<tr>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-right">1</td>
<td class="org-left">yes</td>
<td class="org-left">(Can't happen)</td>
<td class="org-left">(Can't boot side 0 or 1 after golden without updating code)</td>
</tr>

<tr>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-right">0</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Side 1 performed a code update (because side 0 failed), trying side 0 now</td>
</tr>

<tr>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-right">1</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Normal code update flow, side 0 performed a code update, trying side 1 now</td>
</tr>

<tr>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-right">0</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Golden side updated code, trying to boot from side 0 now</td>
</tr>

<tr>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-right">1</td>
<td class="org-left">yes</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Golden side updated code, booting from side 0 failed, trying side 1</td>
</tr>

<tr>
<td class="org-left">No</td>
<td class="org-left">No</td>
<td class="org-right">Golden</td>
<td class="org-left">yes</td>
<td class="org-left">(Can't happen)</td>
<td class="org-left">(Golden side fw is never considered current)</td>
</tr>

<tr>
<td class="org-left">No</td>
<td class="org-left">Yes</td>
<td class="org-right">Golden</td>
<td class="org-left">yes</td>
<td class="org-left">(Can't happen)</td>
<td class="org-left">(Can't do a golden boot twice)</td>
</tr>

<tr>
<td class="org-left">Yes</td>
<td class="org-left">No</td>
<td class="org-right">Golden</td>
<td class="org-left">yes</td>
<td class="org-left">(Can't happen)</td>
<td class="org-left">(Golden side fw is never considered current)</td>
</tr>

<tr>
<td class="org-left">Yes</td>
<td class="org-left">Yes</td>
<td class="org-right">Golden</td>
<td class="org-left">yes</td>
<td class="org-left">(Can't happen)</td>
<td class="org-left">(Can't do a golden boot twice)</td>
</tr>
</tbody>
</table>
</div>
</div>
